apps/paths/load-tests/api-http-load.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  phases:
    - duration: 120
      arrivalRate: 30
      rampTo: 60
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - name: Query GraphQL
    flow:
      - loop:
          - get:
              url: /admin/login/
          - post:
              url: /v1/graphql/
              json:
                query: |
                  query LoadTestQuery($instance: ID!) @instance(identifier: $instance) {
                    instance {
                      id
                    }
                  }
                variables:
                  instance: zuerich
          - post:
              url: /v1/graphql/
              json:
                query: |
                  query LoadTestQuery2($instance: ID!) @instance(identifier: $instance) {
                    actions {
                      name
                      indicatorNode {
                        name
                      }
                    }
                  }
                variables:
                  instance: zuerich
        count: 15