apps/paths/load-tests/browser-test.yml
config:
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 2
      name: Warm up phase
    - duration: 10
      arrivalRate: 2
      rampTo: 5
      name: Ramp up load
    - duration: 120
      arrivalRate: 5
      rampTo: 10
      name: Spike phase

  payload:
    path: urls.csv
    fields:
      - path
      - title

  # Load the Playwright engine:
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: "./flows.cjs"
scenarios:
  #- name: Front page
  #  engine: playwright
  #  testFunction: "frontPageFlow"
  - name: Named URLs
    engine: playwright
    flowFunction: "allPagesFlow"